# -*- coding:utf8 -*- #
# -----------------------------------------------------------------------------------
# ProjectName:   Jakiro_pro
# FileName:     HJ56.py
# Author:      Jakiro
# Datetime:    2021/7/20 21:08
# Description: 完全数计算 完全数（Perfect number），又称完美数或完备数，是一些特殊的自然数。
#
# 它所有的真因子（即除了自身以外的约数）的和（即因子函数），恰好等于它本身。
#
# 例如：28，它有约数1、2、4、7、14、28，除去它本身28外，其余5个数相加，1+2+4+7+14=28。s
#
# 输入n，请输出n以内(含n)完全数的个数。计算范围, 0 < n <= 500000
#
# 本题输入含有多组样例。
# 命名规则  文件名小写字母+下划线，类名大驼峰，方法、变量名小写字母+下划线连接
# 常量大写，变量和常量用名词、方法用动词
# -----------------------------------------------------------------------------------


while True:
    try:
        a = int(input())
        count = 0
        for x in range(3, a + 1):
            l = [1]
            for i in range(2, x//2+1):
                if x % i == 0:
                    l.append(i)
            if sum(l) == x:
                count += 1
        print(count)
    except:
        break