# -*- coding:utf8 -*- #
# -----------------------------------------------------------------------------------
# ProjectName:   Jakiro_pro
# FileName:     HJ57.py
# Author:      Jakiro
# Datetime:    2021/7/21 15:39
# Description: 输入两个用字符串表示的整数，求它们所表示的数之和。
# 字符串的长度不超过10000。
# 本题含有多组样例输入。
# 命名规则  文件名小写字母+下划线，类名大驼峰，方法、变量名小写字母+下划线连接
# 常量大写，变量和常量用名词、方法用动词
# -----------------------------------------------------------------------------------


while True:
    try:
        print(int(input())+int(input()))
    except:
        break