# -*- coding:utf8 -*- #
# -----------------------------------------------------------------------------------
# ProjectName:   Jakiro_pro
# FileName:     HJ58.py
# Author:      Jakiro
# Datetime:    2021/7/21 15:42
# Description:描述 输入n个整数，输出其中最小的k个
# 输入n个整数，输出其中最小的k个。
#
# 本题有多组输入样例，请使用循环读入，比如while(cin>>)等方式处理
# 输入描述：
# 第一行输入两个整数n和k
# 第二行输入一个整数数组
# 输入：
# 输出描述：
# 输出一个从小到大排序的整数数组
# 命名规则  文件名小写字母+下划线，类名大驼峰，方法、变量名小写字母+下划线连接
# 常量大写，变量和常量用名词、方法用动词
# -----------------------------------------------------------------------------------

while 1:
    try:
        a = input()
        b = input()
        a = a.strip().split(' ')
        b = b.strip().split(' ')
        b.sort()
        c = b[0:int(a[1])]
        for i in range(len(c)):
            print(int(c[i]),end=' ')
        pass
    except:
        break
